Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་ན་ཡང་སེར་སྣ་ཡོད་དང་སྦྱིན་པ་ཞེས་བྱ་བའི་མིང་འབྱུང་ལ། འཆལ་བའི་ཚུལ་ཁྲིམས་ལ་སོགས་པ་ཡོད་ན། ཚུལ་ཁྲིམས་ལ་སོགས་པའི་མིང་དུ་འགྱུར་རོ།
en: In the world miserliness exists and the word giving appears, and given that there is immorality and so on, morality and so on come about as words.

source: །གང་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ལ་སེར་སྣ་ལ་སོགས་པ་མི་མཐུན་པའི་ཕྱོགས་ཀྱི་བློ་མེད་པ་དེའི་ཕྱིར་སྦྱིན་པ་ལ་སོགས་པའི་བློ་ཡང་མེད་དོ་ཞེས་བསྟན་པའོ།
en: This is explaining that since the bodhisattvas have no intellectual awareness of miserliness on the opposing side and so on, therefore they have no intellectual awareness of giving and so on either. “

source: །དེ་ནི་བརྒལ་ཏོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ།
en: They do not falsely project ‘they have gotten beyond that.’

source: །མི་བརྒལ་ཏོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ་ཞེས་བྱ་བ་ནི་སེར་སྣ་ལ་སོགས་པ་ལས་བདག་བརྒལ་ཏོ་ཞེས་བྱ་བའམ།
en: They do not falsely project ‘they have not gotten beyond that.’ ”

source: མ་བརྒལ་ཏོ་ཞེས་བྱ་བར་མི་སེམས་ཏེ། དེ་དག་ཉིད་ཤིན་ཏུ་མེད་པའི་ཕྱིར་རོ།
en: They do not think they “have gotten beyond” or “have not gotten beyond” miserliness and so on, because neither of those exist. “

source: །སྦྱིན་པ་དང་སེར་སྣ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་དེ་ཉིད་བསྟན་ཏེ། མི་མཐུན་པའི་ཕྱོགས་དང་གཉེན་པོ་གཉི་གར་ཡང་མི་སེམས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They do not falsely project ‘giving and miserliness’ ” teaches just that, which is to say, they do not think there is either an opposing side or a counteracting side. “

source: །བདག་ལ་སྤྱོས་སོ་ཞེས་བྱ་བའམ།
en: They do not falsely project ‘I have been snubbed.’

source: བདག་ལ་ཕྱག་བྱས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱི་རློམ་སེམས་མེད་དོ་ཞེས་སྟོན་ཏོ།
en: They do not falsely project ‘I have been saluted,’ ” and so on, teach that they do not falsely project the eight worldly dharmas. “

source: །ཤཱ་རིའི་བུ་སྐྱེ་བ་མེད་དོ་ཞེས་བྱ་བ་ནི་ཡང་དག་པའི་མཐའ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Śāriputra, a nonproduction…” means the very limit of reality. “

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཅེས་བྱ་བ་ནི་གང་ཟག་སྟོང་པ་ཉིད་ཀྱི་བཏང་སྙོམས་ཚད་མེད་པའོ། །ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བ་ནི་ཆོས་སྟོང་པ་ཉིད་ཀྱིས་དབུ་མར་གནས་པའི་བཏང་སྙོམས་ཏེ། འདི་ནི་རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་མེད་པའི་བཏང་སྙོམས་ཞེས་བྱའོ། །དེའི་འོག་ཏུ་འཁོར་རྣམས་ཡོངས་སུ་སྨིན་པར་གྱུར་པ་ལུང་བསྟན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསྔགས་པ་དང་། དེ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པ་དང་།
en: In regard to all beings, that they are the same” is immeasurable equanimity because of the emptiness of persons; “that all phenomena are the same” is the equanimity that is an abiding in the middle way because of the emptiness of dharmas, which is to say, it is “the equanimity free from attachment and hatred.”

source: འོད་ཟེར་འགྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་དང་། མཆོད་པའི་བཀོད་པ་དང་། འཁོར་ས་བརྒྱད་ཐོབ་པ་དང་། སྨོན་ལམ་དང་།
en: After that, the prophesy of those in the retinue who have been brought to maturity, the praise of the perfection of wisdom, the praise of bodhisattvas who have set out in the perfection of wisdom, the diffusion of the light, the assembly of the bodhisattvas, the array of the offerings, the retinue that has reached the eighth level, the prayer that is a vow, and the prophesy are all topics that are obvious, as found in the Sūtra.

source: ལུང་བསྟན་པ་དང་། འདི་དག་ཐམས་ཅད་ནི་གཞུང་ལས་འབྱུང་བ་བཞིན་ཏེ། དོན་གསལ་ལོ། །དེ་ལྟར་ཚིག་དང་པོས་མདོར་བསྟན་པ་བཤད་དོ།
en: This is how to explain the brief teaching of the first statement.

source: །ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་དེ་ལ། གང་གི་ཕྱིར་བརྩོན་པར་བྱ་བ་དང་། ཇི་ལྟར་བརྩོན་པར་བྱ་བ་དང་། བརྩོན་པར་བྱེད་པའི་མཚན་ཉིད་གང་ཡིན་པ་དང་། བརྩོན་པར་བྱེད་པ་གང་ཡིན་པ་རྣམས་ཀྱིས་རབ་ཏུ་དབྱེ་བ་དེ་དག་བཅོམ་ལྡན་འདས་དང་གནས་བརྟན་ཤཱ་རིའི་བུས་རྒྱས་པར་བསྟན་ནས།
en: In respect to the exposition in eight parts of “Here, Śāriputra, bodhisattva great beings who want to fully awaken to all dharmas in all forms should make an effort at the perfection of wisdom,” the Lord and the elder Śāriputra have expounded in detail why bodhisattvas endeavor, how bodhisattvas endeavor, the defining marks of those who endeavor, andthose who endeavor.

source: ད་ནི་བརྩོན་པ་ལ་གདམས་པ་གང་ཡིན་པ་དང་། བརྩོན་པའི་ཕན་ཡོན་གང་ཡིན་པ་ལ་སོགས་པ་བཤད་པར་བྱ་བ་རྣམ་པ་བཞི་ལས། གནས་བརྟན་རབ་འབྱོར་གྱིས་བརྩོན་པ་ལ་གདམས་པ་བསྟན་ཏོ།
en: Instructions for the endeavor Now, of the four parts, instructions for the endeavor, the benefits of the endeavor, and so on that now have to be explained, the elder Subhūti teaches the instructions for the endeavor.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཐབས་མཁས་པས་དེ་ལྟར་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་འདུལ་བ་ལས་བརྩམས་ཏེ་བསྟན་ཏོ། །དེ་ཉིད་ཀྱི་ཕྱིར་ཤཱ་རིའི་བུས་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱི་ཐབས་ལ་མཁས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་ཏོ་ཞེས་བྱ་བ་འོག་ནས་འཆད་དོ། །ཅི་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདི་རང་གི་ཤེས་རབ་དང་།
en: But it is actually the Lord teaching in that way, with skillful means to bring trainees to maturity, so it will say below, “Śāriputra, it is just the Tathāgata who, by skillful means, will expound the perfection of wisdom to the bodhisattva great beings.”

source: སྤོབས་པའི་སྟོབས་བསྐྱེད་པས་ཞེས་བྱ་བ་ནི།
en: In regard to, “Will venerable Subhūti instruct… on account of armor in which reposes the power of his own intellect and ready speech?”

source: ཉན་ཐོས་རྣམས་ཀྱི་ཡུལ་ནི་ཉན་ཐོས་རྣམས་ཀྱིས་ཤེས་ན། ཅིའི་ཕྱིར་ཉན་ཐོས་རྣམས་ལ་ཐེ་ཚོམ་འདི་འབྱུང་ཞེ་ན།
en: śrāvakas know the objects of śrāvakas, so why would śrāvakas have such uncertainty [about his being such a great bodhisattva]?

source: དེ་ལ་ཉེས་པ་མེད་དེ། གནས་བརྟན་རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིན་ཏེ། བསྐལ་པ་གྲངས་མེད་པ་ནས་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་བསགས་ལ། ཆོས་ཟབ་མོ་ལ་བཟོད་པ་ཐོབ་པར་གྲགས་པ་སྟེ། དེ་བས་ན་ཐམས་ཅད་ཀྱང་དེ་ལྟར་ཐེ་ཚོམ་དུ་གྱུར་ཏོ།
en: There is nothing wrong with that, because the elder Subhūti is a bodhisattva great being who for immeasurable eons has accumulated stores of merit and wisdom, and is famous for having gained forbearance for the deep dharmas, so all have become uncertain like that.

source: །དེའི་ཕྱིར་རབ་འབྱོར་གྱིས་བདག་ཉིད་ཀྱི་ཚིག་ཡིན་པར་བསྟན་ན་གཟུང་བར་འགྱུར་བ་མ་ཡིན་པའི་སྐྱོན་དུ་འགྱུར་བ་བསལ་བའི་ཕྱིར། འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་ཡིན་གྱི། བདག་གི་ཚིག་ནི་མ་ཡིན་ནོ་ཞེས་བསལ་ཏོ། །སྨྲ་ཡང་རུང་། ལུང་སྟོན་ཀྱང་རུང་།
en: Therefore, to eliminate the fault which might occur were Subhūti to teach in his own words, which is that they might not be accepted, he emphasizes that they are the words of the Lord, not his own words. “

source: བརྗོད་ཀྱང་རུང་ཞེས་བྱ་བ་ནི་འདུལ་བ་རྣམ་པ་གསུམ་པོ་རྣམས་ལས། མདོ་དང་འབྲིད་དང་། རྒྱས་པ་རྣམས་སུ་དབྱེ་བའམ། ཡང་ན་བདག་གི་ལྷག་པའི་བསམ་པ་དང་། གཞན་གྱི་ལྷག་པའི་བསམ་པའི་སྐབས་དང་།
en: Whatever the Lord’s śrāvakas say, teach, and expound”— it indicates those three because, on account of the three types to be disciplined, there is a division into brief, intermediate, and detailed teaching; alternatively, it is because of the threefold surpassing aspiration for themselves, and the temporary, and contextually appropriate, surpassing aspiration for others.

source: སྐབས་སུ་བབ་པ་དང་། རྣམ་པ་གསུམ་གྱི་ཕྱིར་རྣམ་པ་གསུམ་དུ་བསྟན་ཏོ། །ད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བའི་ཚིག་དང་པོ་ལ་བསྟན་པ་གང་ཡིན་པ་དེ་བསྟན་པའི་ཕྱིར་དེ་ཉིད་བཟུང་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྩོམ་སྟེ། ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་སྤོབས་པ་སྐྱེད་ཅིག་ཅེས་སྐབས་ཕྱེ་བ་དང་། གནས་བརྟན་རབ་འབྱོར་གྱིས་མིང་དང་བརྡར་གདགས་པས་བརྩོན་པ་ལ་གདམས་པ་དང་།
en: Now, in order to give an exposition of what is taught in the first statement, “bodhisattva great beings… should make an effort at the perfection of wisdom,” taking that as the point of departure, to set the scene, The Lord… said…, “Subhūti, starting with the perfection of wisdom, be confident in your readiness to give a Dharma discourse to the bodhisattva great beings about how bodhisattva great beings go forth in the perfection of wisdom.”

source: སེམས་ཅན་མི་དམིགས་པས་བརྩོན་པ་ལ་གདམས་པ་དང་། ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པས་བརྩོན་པ་ལ་གདམས་པ་དང་། ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པས་བརྩོན་པ་ལ་གདམས་པ་དང་། གདམས་པ་བཞི་སྐབས་དབྱེ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་བ་ཆོས་གང་གི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུས་སོ།
en: The elder Subhūti, to himself set the scene for four instructions— instructions for making an effort by using names and conventional terms conventionally,instructions for making an effort without apprehending beings,instructions for making an effort by not apprehending words for things, andinstructions for making an effort when all dharmas cannot be apprehended— asks, “Lord, … [w]hat phenomenon is this, the word bodhisattva great being, for?”

source: །དེ་ལ་མདོར་བསྟན་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཞེས་གསུངས་ལ།
en: There in the brief teaching, the Lord said “bodhisattva great beings,” but the phenomenon bodhisattva does not exist at all.

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཆོས་ནི་གང་ཡང་མེད་ཅིང་དེ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་ཀྱང་གསུངས་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱང་གང་ཡང་མེད་ན།
en: And he also said “perfection of wisdom,” but the phenomenon perfection of wisdom does not exist at all.

source: དེ་ལ་ཆོས་འདི་གཉིས་དམིགས་སུ་མེད་བཞིན་དུ་ཅི་ཞིག་སུ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བྱ་ཞེས་ཞུས་པ་དང་།
en: So, given that those two phenomena cannot be apprehended, Subhūti asks whom he should be instructing and advising about what.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ཁྱོད་དེ་སྐད་དུ་མ་སྨྲ་ཞིག།
en: Do not say that, the Lord says to Subhūti.

source: གལ་ཏེ་ཁྱོད་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་མེད། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་མེད་དོ་སྙམ་དུ་བསམས་ནས་ཅང་མི་ཟེར་བར་གྱུར་ན། དེ་ལྟ་ན་ནི་སེམས་ཅན་གྱི་དོན་ཉམས་པར་འགྱུར་རོ།
en: If you therefore think there is nothing to say because a bodhisattva does not exist and even the perfection of wisdom does not exist, you deprive beings of what they need.

source: །དོན་དམ་པར་ཡོངས་སུ་གྲུབ་པའི་བདག་ཉིད་དུ་ཆོས་དེ་གཉིས་སུ་མེད་དུ་ཟིན་ཀྱང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་སོགས་པའི་དོན་དེ་ཐབས་མཁས་པས་ཀུན་བརྟགས་པའི་མཚན་ཉིད་ཡོངས་སུ་བཟུང་ནས། ཀུན་རྫོབ་ཀྱི་ཚུལ་དུ་སེམས་ཅན་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གདམས་པར་བྱའོ།
en: It is therefore said, “Even though those two dharmas do not ultimately exist in their thoroughly established nature, you should take hold of their imaginary marks with skillful means in order to bring beings to maturity and so on, and give advice to beings in the perfection of wisdom in the conventional way.

source: །གཞན་དུ་ན་ནི་སེམས་ཅན་གྱི་དོན་རབ་ཏུ་ཉམས་པར་འགྱུར་རོ་ཞེས་བསྟན་ནས།
en: Otherwise, you will deprive beings of what they need.”

source: དང་པོར་བཏགས་པའི་གདམས་པ་བསྟན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་མིང་དང་བརྡར་བཏགས་པ་རྣམས་དེ་ལྟར་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་གིས་བསྟན་ཏོ།
en: First, the teaching instruction about designation is the passage that teaches up to, “Subhūti, bodhisattva great beings practicing the perfection of wisdom should thus understand names and conventional terms.”

source: །དེ་ལྟར་བཏགས་པས་གདམས་ནས་དོན་དམ་པར་བཏགས་པ་བསྟན་དགོས་ཏེ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་ན་ཞེས་བྱ་བ་གནས་བརྟན་གྱིས་ཞུས་པའི་ཚིག་བཟུང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་མམ། གཟུགས་མ་ཡིན་པ་གཞན་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་མམ་ཞེས་བྱ་བ་ལ་སོགས་པས་དྲི་བ་རིམ་པ་ལྔ་ཉེ་བར་བཏགས་ནས།
en: Having thus given instructions in designation, ultimately what is designated has to be taught, so the Lord, asking a question, uses the elder [Subhūti’s] words, “Lord, you say… ‘bodhisattva great being,’” as his point of departure, framing a series of five questions with, “What do you think, Subhūti, is the bodhisattva form, or is the bodhisattva other than form?”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་མ་མཆིས་ཤིང་མི་དམིགས་ན།
en: and so on. Then the elder Subhūti’s words, “Lord, when a bodhisattva great being absolutely does not exist and cannot be apprehended, how could that form be a bodhisattva?”

source: དེ་ལ་གཟུགས་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་བ་ལྟ་ག་ལ་མཆིས་ཞེས་བྱ་བ་ལ་སོགས་པ་གནས་བརྟན་རབ་འབྱོར་གྱི་ཚིག་རྣམས་ཀྱིས་སེམས་ཅན་རྣམས་དམིགས་སུ་མེད་པའི་གདམས་པ་བསྟན་ཏོ།
en: and so on, teaches the instructions without apprehending beings.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་མི་དམིགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་དག་གིས་བསྟན་ཏོ།
en: It is taught in the passage that goes up to, “Bodhisattvas, Subhūti, should train in the perfection of wisdom like that, without apprehending a being.”

source: །དེ་ནས་ཡང་འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་འདི་ཆོས་གང་གི་ཚིག་བླ་དགས་ལགས་ཞེས་ཞུས་པའི་ཚིག་བཟུང་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: Then the Lord, again taking the words of the question, “What phenomenon is this, the word bodhisattva, for?”

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་གཟུགས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཡིན་སྙམ་མམ་ཞེས་བྱ་བ་ལ་སོགས་པ་དྲིས་ནས།
en: as his point of departure, asks, “Subhūti… what do you think, is bodhisattva the word for form?”

source: བཅོམ་ལྡན་འདས་གཟུགས་ཤིན་ཏུ་མ་མཆིས་ཤིང་མི་དམིགས་ན།
en: and so on, and with, “Lord, when a form absolutely does not exist and cannot be apprehended, how could bodhisattva be the word for form?”

source: བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སུ་འགྱུར་བ་ལྟ་ག་ལ་མཆིས་ཞེས་བྱ་བ་ལ་སོགས་པ་གནས་བརྟན་རབ་འབྱོར་གྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པར་བསྟན་ནས།
en: and so on, teaches not apprehending a word for the elder Subhūti’s word.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པའི་ཚེ།
en: Having done so, the passage from, “Subhūti! …

source: གཟུགས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པ་ཞེས་བྱ་བ་ནས་སྨོན་པ་མེད་པའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གདམས་པ་བསྟན་ཏོ།
en: when bodhisattva great beings are practicing the perfection of wisdom like that they should train in the perfection of wisdom without apprehending a word for form,” up to “should train in the perfection of wisdom without apprehending a word for wishlessness,” teaches the instruction in the perfection of wisdom.

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའི་ཆོས་དེ་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་ཞུས་པའི་ཚིག་བཟུང་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ཆོས་ཐམས་ཅད་མི་དམིགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་དག་གིས་ཆོས་ཐམས་ཅད་མི་དམིགས་པར་བསྟན་ནས་དེ་ཉིད་ཀྱིས་གདམས་པ་མཛད་དོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གདམས་པའོ།
en: Then the Lord, again having taken the words of the inquiry, “I do not see that—namely, the phenomenon with the name bodhisattva,” as his point of departure, in the passages from, “The Lord, Subhūti, does not see the dharma-constituent,” and so on, up to the end, “Subhūti, bodhisattva great beings should practice the perfection of wisdom like that, without apprehending all dharmas,” teaches not apprehending all dharmas.

source: །དེ་ཉིད་རྗེས་སུ་བསྟན་པ་ཡིན་ནོ་ཞེས་བྱ་བས་གདམས་པ་བཞི་པོ་དེ་དག་ཉིད་ཀྱིས་མཇུག་བསྡུས་སོ།
en: Just that is the instruction. “That is the advice about the perfection of wisdom of bodhisattvas, just that is the instruction” brings the four instructions to a conclusion.

source: །དེ་ལ་མིང་དང་བརྡར་གདགས་པའི་གདམས་པ་སྔར་སྨོས་པ་ལས། འདི་ནི་མིང་ཙམ་སྟེ་མིང་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་མེད་པར་བསྟན་ནས་མིང་དེ་ནི་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ་ཞེས་བྱ་བས་མིང་གི་ཆོས་གཞན་དུ་གྱུར་པ་མེད་པའི་གཏན་ཚིགས་བཤད་དོ།
en: Instructions for making an effort by using names and conventional terms conventionally Among these, for the instructions for using names and conventional terms conventionally spoken about first, having taught that a “name” in the form of some other phenomenon does not exist with “those… are just words,” with those words “do not exist inside, do not exist outside, and they cannot be apprehended where both do not exist” it explains the reason why a name in the form of some other phenomenon does not exist.

source: །གལ་ཏེ་མིང་ཞེས་བྱ་བའི་ཆོས་གཞན་དུ་གྱུར་པ་འགའ་ཞིག་ཡོད་ན་ནི། ནང་ངམ་ཕྱི་རོལ་ལམ་དེ་གཉིས་ལས་གཞན་པ་གང་ཡང་རུང་བ་གསུམ་ལས་འགའ་ཞིག་གི་ནང་ནས་དམིགས་པར་འགྱུར་བ་ཞིག་ན།
en: Were some name in the form of some other phenomenon to exist, you would apprehend it as one from among the three—inner, or outer, or as other than those two.

source: འདི་ལྟར་དེ་གསུམ་ཅར་ལ་ཡང་རྣམ་པར་དཔྱད་ན་མི་རིགས་ཏེ་དེ་བས་ན་དེ་ཡོད་པ་མ་ཡིན་ནོ།
en: But, because when you investigate all three are untenable it therefore does not exist.

source: །འདིར་ཡང་ཆོས་དང་མཐུན་པའི་དཔེ་རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་སེམས་ཅན་སེམས་ཅན་ཞེས་བྱ་བར་མིང་དུ་བརྗོད་ཀྱང་སེམས་ཅན་གང་ཡང་མི་དམིགས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པ་བསྟན་ཏོ།
en: Here, furthermore, “Subhūti, it is like this: the word being is uttered again and again, but you cannot apprehend any being,” and so on, teaches by analogy.

source: །དེ་ནས་ཡང་མིང་ལས་ཆོས་གཞན་དུ་གྱུར་པ་མེད་པའི་གཏན་ཚིགས་གཉིས་པ་བཏགས་པའི་ཆོས་དེ་ནི་མིང་དང་བརྡ་ཙམ་དུ་ཐ་སྙད་དུ་གདགས་པ་མ་གཏོགས་པར་སྐྱེ་བ་འམ་འགག་པ་མེད་དེ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Then it gives a second reason why a name in the form of some other phenomenon does not exist, with “and except for being used conventionally as a mere word and conventional term, any phenomenon that is a designation is not produced and does not stop,” and so on.

source: །གལ་ཏེ་ཆོས་རྣམས་ཀྱི་མིང་ཆོས་གཞན་ཞིག་ཏུ་གྱུར་པ་ཞིག་ཡོད་ན་ནི་མིང་དེ་སྐད་ཅེས་བྱ་བའི་ཆོས་སྐྱེ་བར་གྱུར་པ་ན་དེ་ཡང་སྐྱེ་བར་གྱུར་པ་ཞིག་ན་སྐྱེ་བར་ཡང་མི་འགྱུར་ཏེ།
en: Were the names of phenomena to exist in the form of some other phenomena, when the phenomena when names are spoken arise, they too would arise, but they do not arise.

source: འདི་ལྟར་ཐ་སྙད་དུ་གདགས་སུ་རུང་བར་བྱ་བའི་ཕྱིར་བརྡའི་ཚུལ་གྱིས་གཞན་དག་ལ་འདིའི་མིང་ནི་འདི་ཞེས་ཕྱིར་རྣམ་པར་འཇོག་གོ།
en: Thus, because they are suitable to work as conventional labels, through their operation as conventional terms they are later stated to others with, “This is its name.”

source: །གལ་ཏེ་ཆོས་ཉིད་སྐྱེ་བའི་དུས་ཉིད་ན་མིང་སྐྱེས་པར་གྱུར་ན་ནི། གཞན་དག་གིས་མཐོང་མ་ཐག་ཏུ་བརྡར་མི་ཤེས་པས་ཀྱང་འདིའི་མིང་འདི་ཡིན་ནོ་ཞེས་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་ཞིག་ན། ཁོང་དུ་ཡང་མི་ཆུད་དེ།
en: Were a name produced when the phenomenon itself is produced, others would then, right when they see it, even without knowing the conventional term, understand that “this is its name.”

source: དེ་བས་ན་ཆོས་སྐྱེས་ཀྱང་མིང་མི་སྐྱེ་ལ་ཆོས་འགག་ཀྱང་མིང་མི་འགག་སྟེ།
en: But they do not have that understanding, so, even though the phenomenon is produced the name is not produced, and even though the phenomenon stops the name does not stop.

source: འདིར་མིང་དེ་སྐད་ཅེས་བྱ་བའི་དངོས་པོ་འགག་ཀྱང་མིང་དེ་སྐད་ཐ་སྙད་དུ་འདོགས་ཤིང་མེད་པར་མི་འགྱུར་ཏེ།
en: Even though something that is a name for something might cease, its working as a conventional label does not.

source: དེའི་ཕྱིར་སྐྱེ་བ་དང་འགག་པ་མེད་པར་ཆོས་གཞན་དུ་གྱུར་པ་ནི་མེད་ཀྱི། བདག་དང་སེམས་ཅན་ཞེས་བྱ་བ་ལ་སོགས་པ་བཞིན་དུ་ཐ་སྙད་དུ་ཟད་དོ་ཞེས་བསྟན་ཏོ། །འདིར་ཡང་དཔེའི་ཚུལ་གྱིས་ཆོས་རྣམ་པ་བཞི་བཟུང་སྟེ། ཐ་སྙད་ཙམ་དུ་ཟད་པའི་ཕྱིར་ཉན་ཐོས་ཀྱི་ཚུལ་ལ་གྲགས་པ་བདག་དང་སེམས་ཅན་ལ་སོགས་པ་དང་། ཀུན་བརྟགས་པ་ཙམ་དུ་ཟད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ལ་གྲགས་པ་ཕུང་པོ་དང་།
en: Therefore, this teaches that it does not exist in the form of some other phenomenon because its production and stopping do not exist, but like a “self” and a “being” it is there simply as a convention.

source: ཁམས་དང་། སྐྱེ་མཆེད་རྣམས། ཉེ་བར་བཟུང་ནས་བཏགས་པའི་མིང་ཙམ་དུ་ཟད་པའི་ཕྱིར། གཉི་ག་ལ་གྲགས་པ་ནང་དང་ཕྱིའི་བྱེ་བྲག་ལས་ལུས་དང་རྩྭ་ཤིང་ལ་སོགས་པ་དང་། ཤིན་ཏུ་མེད་པའི་ཕྱིར་འཇིག་རྟེན་ཐམས་ཅད་ལ་གྲགས་པ་རྨི་ལམ་དང་བྲག་ཅ་དང་། སྨིག་རྒྱུ་ལ་སོགས་པའོ།
en: Here, furthermore, by way of illustration, it starts with four types of things: “self, being,” and so on, known from the śrāvaka system because they exist simply as a convention; the aggregates, constituents, and sense fields, known from the system of the bodhisattvas because they exist simply as imaginary phenomena; the “body” and “grass,” and so on, that are particular inner and outer objects known from both because they exist simply as the names designated based on something; and a “dream, echo, mirage,” and so on, known in all worlds are because they are totally nonexistent.

source: །དེའི་འོག་ཏུ་མིང་དུ་བཏགས་པའི་གདམས་པ་མཇུག་བསྡུས་པའི་ཕྱིར། རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མིང་དང་བརྡར་བཏགས་པ་དང་། གདམས་ངག་ཏུ་བཏགས་པ་དང་། ཆོས་སུ་བཏགས་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བ་བསྟན་ཏེ་སྒྲོ་བཏགས་པ་དང་།
en: After that, to bring the instruction in name designation to a conclusion, it says, “Subhūti, when bodhisattva great beings are practicing the perfection of wisdom they should train in names and conventional terms that make things known, in advice that makes things known, and in dharmas that make things known.”

source: སྐུར་པ་འདེབས་པའི་མཐའ་སྤང་བའི་ཕྱིར་མིང་དང་བརྡར་བཏགས་པ་སྔར་སྨོས་སོ།
en: This speaks first about designation that is a name and conventional term, in order to avoid the extremes of over-reification and over-negation.

source: །དེ་ལ་གནས་ཏེ་ཆོས་བཤད་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དང་གདམས་པའི་བཏགས་པ་ཕྱིས་སྨོས་སོ།
en: It speaks about designation that is advice while remaining in that state, because they explain the doctrine in order to bring beings to maturity.

source: །དེའི་འོག་ཏུ་དེ་གཉི་གས་ཆོས་རྣམས་ཐ་སྙད་དུ་འདོགས་སོ་ཞེས་ཀུན་བརྟགས་པའི་ཆོས་སུ་གསུངས་སོ།
en: Then, since they both designate the dharmas as conventional terms, it says they are imaginary dharmas.

source: །དེ་ནས་ཡང་བཏགས་པ་དེ་གསུམ་གྱི་ཡོན་ཏན་བསྟན་པའི་ཕྱིར། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པས་ནི་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Then, to teach the benefit of those three designations, it again says, “Subhūti, bodhisattva great beings thus practicing the perfection of wisdom do not view ‘form is permanent,’ ” and so on.

source: །རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤངས་པ་ནི་བཏགས་པ་ཙམ་དུ་ཟད་པར་སློབ་པའི་འབྲས་བུར་བསྟན་ཏོ།། །།བམ་པོ་བརྒྱད་པ།
en: This is explaining that the result of training in things being simply just designated is the elimination of all conceptualizations.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་རྟོག་པ་དེ་དག་ཀྱང་རྣམ་པ་གསུམ་སྟེ། ལྷག་མཐོང་གི་སྤྱོད་ཡུལ་དང་། རྣམ་པར་ཐར་པའི་སྒོའི་སྤྱོད་ཡུལ་དང་། ཆོས་རྣམས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་པའི་སྤྱོད་ཡུལ་ལོ།
en: Those conceptualizations of śrāvakas and pratyekabuddhas, furthermore, are threefold: those falling within the province of insight, those falling within the province of the three gateways to liberation, and those falling within the province of the perfect analytic understanding of the reality of dharmas.

source: །དེ་ལ་ལྷག་མཐོང་གི་སྤྱོད་ཡུལ་ནི་བླང་བ་དང་དོར་བའི་དབང་གིས་ནག་པོ་དང་དཀར་པོའི་ཕྱོགས་འཕགས་པའི་བདེན་པ་བཞིའི་གནས་སུ་གྱུར་པ་ཆོས་ཀྱི་མདོར་རྣམ་པར་རྟོག་པ་བཞི་སྟེ། མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བར་རྣམ་པར་རྟོག་པ་རྣམས་དང་། དེ་དག་གི་མི་མཐུན་པའི་ཕྱོགས་སུ་གྱུར་པ་རྟག་པ་དང་། བདེ་བ་དང་། བདག་ཡོད་པ་དང་། མ་ཞི་བར་རྣམ་པར་རྟོག་པ་རྣམས་སོ།
en: Among these, those falling within the province of insight are the conceptualizations summarizing the doctrine that serve as the foundation for the four noble truths based on the bright side and the dark side that are accepted and rejected: the conceptualizations of impermanence, suffering, selflessness, and calm, and the conceptualizations of permanence, pleasure, self, and not calm that are the side opposing those.
